var canvas;
var ctx;
var nametbl = [
"玉","飛","角","金",
"銀","桂","香","歩",
"","竜","馬","",
"全","圭","杏","と"
];
var x1 = [ 0, 1, 1, 1, 0,-1,-1,-1, 1,-1];
var y1 = [-1,-1, 0, 1, 1, 1, 0,-1,-2,-2];
var movtbl = [
	[1,1,1,1,1,1,1,1,0,0],
	[2,0,2,0,2,0,2,0,0,0],
	[0,2,0,2,0,2,0,2,0,0],
	[1,1,1,0,0,0,1,1,0,0],
	[1,1,0,1,0,1,0,1,0,0],
	[0,0,0,0,0,0,0,0,1,1],
	[2,0,0,0,0,0,0,0,0,0],
	[1,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[2,1,2,1,2,1,2,1,0,0],
	[1,2,1,2,1,2,1,2,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[1,1,1,0,1,0,1,1,0,0],
	[1,1,1,0,1,0,1,1,0,0],
	[1,1,1,0,1,0,1,1,0,0],
	[1,1,1,0,1,0,1,1,0,0],
];
var fillColor = ["white","LightPink","fuchsia"];
var psize = 20;

function init(){
	canvas = document.getElementById("world");
	canvas.width = 800;
	canvas.height = 600;
	ctx.font = "16px";
	for(id=0; id<16; id++){
		cx=(id%8)*4+2;
		cy=Math.floor(id/8)*6+2;
		movePiece(cx,cy,id);
	}
}
function movePiece(){
	ctx.fillStyle = "Khaki";
	
}