R version 3.3.2 (2016-10-31) -- "Sincere Pumpkin Patch"
Copyright (C) 2016 The R Foundation for Statistical Computing
Platform: x86_64-apple-darwin13.4.0 (64-bit)

R は、自由なソフトウェアであり、「完全に無保証」です。 
一定の条件に従えば、自由にこれを再配布することができます。 
配布条件の詳細に関しては、'license()' あるいは 'licence()' と入力してください。 

R は多くの貢献者による共同プロジェクトです。 
詳しくは 'contributors()' と入力してください。 
また、R や R のパッケージを出版物で引用する際の形式については 
'citation()' と入力してください。 

'demo()' と入力すればデモをみることができます。 
'help()' とすればオンラインヘルプが出ます。 
'help.start()' で HTML ブラウザによるヘルプがみられます。 
'q()' と入力すれば R を終了します。 

> a<-array(1,2,3,4)
array(1, 2, 3, 4) でエラー:  使われていない引数 (4) 
> a<-array(1,2,3)
array(1, 2, 3) でエラー:  'dimnames' はリストでなければなりません 
> x<-1:10
> x
[1]  1  2  3  4  5  6  7  8  9 10
> y<-1:10
> plot(x,y)
> c<-1:150
> c.length
エラー:  オブジェクト 'c.length' がありません 
> c length
エラー:  想定外のシンボルです  in "c length"
> plot(c,y)
xy.coords(x, y, xlabel, ylabel, log) でエラー: 
  'x' and 'y' lengths differ
> plot(x,y)
> plot(c,y)
xy.coords(x, y, xlabel, ylabel, log) でエラー: 
  'x' and 'y' lengths differ
> x<-1:150
> t<-1:150
> plot(x,t)
> c
[1]   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22
[23]  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40  41  42  43  44
[45]  45  46  47  48  49  50  51  52  53  54  55  56  57  58  59  60  61  62  63  64  65  66
[67]  67  68  69  70  71  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88
[89]  89  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107 108 109 110
[111] 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132
[133] 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150
> plot(c,x)
> plot(c,6)
xy.coords(x, y, xlabel, ylabel, log) でエラー: 
  'x' and 'y' lengths differ
> plot(c,y=6)
xy.coords(x, y, xlabel, ylabel, log) でエラー: 
  'x' and 'y' lengths differ
> x
[1]   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22
[23]  23  24  25  26  27  28  29  30  31  32  33  34  35  36  37  38  39  40  41  42  43  44
[45]  45  46  47  48  49  50  51  52  53  54  55  56  57  58  59  60  61  62  63  64  65  66
[67]  67  68  69  70  71  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88
[89]  89  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107 108 109 110
[111] 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132
[133] 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150
> x<-0
> x
[1] 0
> sample<-1:43
> sample
[1]  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30
[31] 31 32 33 34 35 36 37 38 39 40 41 42 43
> 
  > jimin<-50
> minshin<-40
> kyosan<-
  + 
  + 10
> rep("自民",50)
[1] "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民"
[14] "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民"
[27] "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民"
[40] "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民" "自民"
> minnsinn 
エラー:  オブジェクト 'minnsinn' がありません 
> pop<-c(rep("自",50),rep("民",50),rep("共産",50),)
c(rep("自", 50), rep("民", 50), rep("共産", 50), ) でエラー: 
  引数 4 が空です 
> pop<-c(rep("自",50),rep("民",50),rep("共産",50))
> pop
[1] "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"  
[13] "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"  
[25] "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"  
[37] "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"   "自"  
[49] "自"   "自"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"  
[61] "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"  
[73] "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"  
[85] "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"   "民"  
[97] "民"   "民"   "民"   "民"   "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産"
[109] "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産"
[121] "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産"
[133] "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産" "共産"
[145] "共産" "共産" "共産" "共産" "共産" "共産"
> sample(pop,20,replace=FALSE)
[1] "民"   "共産" "共産" "共産" "民"   "自"   "民"   "自"   "共産" "共産" "共産" "共産" "共産"
[14] "共産" "自"   "共産" "自"   "自"   "民"   "共産"
> sample(pop,20,replace=FALSE)
[1] "自"   "自"   "自"   "民"   "民"   "共産" "自"   "自"   "共産" "民"   "民"   "共産" "民"  
[14] "共産" "共産" "自"   "民"   "民"   "共産" "自"  
> sample(pop,20,replace=FALSE)
[1] "民"   "共産" "民"   "共産" "共産" "自"   "共産" "共産" "自"   "自"   "自"   "民"   "民"  
[14] "共産" "民"   "自"   "民"   "共産" "自"   "自"  
> res<-sample(pop,20,replace=FALSE)
> res<-ac.factor(res)
エラー:  関数 "ac.factor" を見つけることができませんでした 
> res<-as.factor(res)
> summary(res)
共産   自   民 
6    7    7 
> summary(res)
共産   自   民 
6    7    7 
> summary(res)
共産   自   民 
6    7    7 
> summary(res)
共産   自   民 
6    7    7 
> res<-as.factor(res)
> summary(res)
共産   自   民 
6    7    7 
> res[res=="自"]
[1] 自 自 自 自 自 自 自
Levels: 共産 自 民
> lenghth(res[res=="民"])
エラー:  関数 "lenghth" を見つけることができませんでした 
> length(res[res=="民"])
[1] 7
> diff<-length(res[res=="自"])-lenghth(res[res=="民"])
エラー:  関数 "lenghth" を見つけることができませんでした 
> diff<-length(res[res=="自"])-length(res[res=="民"])
> dif
エラー:  オブジェクト 'dif' がありません 
> diff
[1] 0
> hist(result)
hist(result) でエラー:  オブジェクト 'result' がありません 
> result<-0
> hist(result)
> pop<-c(rep("jimin",5000),rep("minshin",5000),("jimin",5000))
エラー:  予想外の ',' です  in "pop<-c(rep("jimin",5000),rep("minshin",5000),("jimin","
> 
  > 
  > party<-("自","民","共","公")
エラー:  予想外の ',' です  in "party<-("自","
> party<-c("自","民","共","公")
> print(table(sample(party)))

共 公 自 民 
1  1  1  1 
> print(table(sample(party))*5)

共 公 自 民 
5  5  5  5 
> print(table(sample(party)))

共 公 自 民 
1  1  1  1 
> for(i in 1:100){}
> for(i in 1:100){print(table(sample(party)))}

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 
> for(i in 1:100){print(table(sample(party)))}

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 

共 公 自 民 
1  1  1  1 
> party<-c("自","民","共","公")
> support<-c(0.5,0.4,0.05,0.05)
> aichi<-(68,79,13,9)
エラー:  予想外の ',' です  in "aichi<-(68,"
> aichi<-c(68,79,13,9)
> chisq.test(aichi,p=support)

Chi-squared test for given probabilities

data:  aichi
X-squared = 7.6302, df = 3, p-value = 0.05431

> 的神戸検定
エラー:  オブジェクト '的神戸検定' がありません 
> #適合度検定
  > 
  > 
  > #カイ２乗検定
  > x<-10
> y<-50
> hist(x,y)
> x<-10
> y<-50
> hist(x,y)
> #独立性検定
  > hist(x)
> y<-
  + 10
> hist(x,y)
> chimane<-c(12,7,1,1)
> d<-matrix(c(aichi,shimane),nrow=2,byrow=TRUE)
matrix(c(aichi, shimane), nrow = 2, byrow = TRUE) でエラー: 
  オブジェクト 'shimane' がありません 
> shimane<-c(12,7,1,1)
> d<-matrix(c(aichi,shimane),nrow=2,byrow=TRUE)
> chisq.test(d,simulate.p.value=TRUE)

Pearson's Chi-squared test with simulated p-value (based on 2000 replicates)

data:  d
X-squared = 2.2393, df = NA, p-value = 0.5312

> shimane<-c(12,7,1,1)*10
> shimane
[1] 120  70  10  10
> d<-matrix(c(aichi,shimane),nrow=2,byrow=TRUE)
> chisq.test(d,simulate.p.value=TRUE)

Pearson's Chi-squared test with simulated p-value (based on 2000 replicates)

data:  d
X-squared = 11.065, df = NA, p-value = 0.01449

> #大学院入試に男女差はあるか
  > #シンプソンのパラドックス
  > #censored data
  
  1+1

  